
&НаКлиенте
Асинх Процедура Переместить(Команда)
	
	Если НЕ СтрНайти(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока, "полка") > 0 Тогда
		Книга = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
		ЭтотШкаф = СтрРазделить(ЭтаФорма.ИмяФормы, ".");
		СписокШкафов = Перемещение.СоздатьСписокШкафов(ЭтотШкаф[1]);
		Шкаф = ЖДАТЬ ВопросАсинх("Куда переместить?", СписокШкафов);
		СписокПолок = ПеремещениеСервер.ПолучитьСписокПолок(Шкаф);
		Полка = ЖДАТЬ ВопросАсинх("А на какую полку?", СписокПолок);
		Перемещение.Переместить(Книга, ЭтотШкаф[1], Шкаф, Полка);
		ЭтотОбъект.ТекущийЭлемент.Обновить();
	Иначе
		ВызватьИсключение ("Мам, ты книгу не выбрала", КатегорияОшибки.НеподдерживаемыйФормат);
	КонецЕсли;
	
КонецПроцедуры
