
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	КомандаСистемы("СкриптЗагрузки.bat", "C:\VSC");
	ВыполнитьКомандуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()

			
КонецПроцедуры 

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Headers", "Accept: application/vnd.github+json");
    Запрос = Новый HTTPЗапрос("repos/Abstract2324/HomeLibrary/commits", Заголовки);
	ССЛ = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows);
	ГетЗапрос = Новый HTTPСоединение("api.github.com",,"anton00000_0@mail.ru", "s320560ds",,,ССЛ);   
	Ответ = ГетЗапрос.ВызватьHTTPМетод("GET", Запрос);
	Тело = Ответ.ПолучитьТелоКакПоток();
	ЧтениеДжейсона = Новый ЧтениеJSON();
	ЧтениеДжейсона.ОткрытьПоток(Тело);
	Массив = ПрочитатьJSON(ЧтениеДжейсона);
	ВерсияКонфы = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияВерсийСрезПоследних.Версия КАК Версия
		|ИЗ
		|	РегистрСведений.ИсторияВерсий.СрезПоследних КАК ИсторияВерсийСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВерсияКонфы = ВыборкаДетальныеЗаписи.Версия;
	КонецЦикла;
		
	Если Массив[0].commit.message = ВерсияКонфы Тогда
		Элементы.Декорация1.Заголовок = "Обновлений нет!";
		Элементы.Выполнить.Доступность = Ложь;
	Иначе 
		ДатаОбновления = Лев(Массив[0].commit.author.date, 10);
		ДатаОбновления = СтрРазделить(ДатаОбновления, "-");
		ДатаОбновления = ДатаОбновления[2] + "." + ДатаОбновления[1] + "." + ДатаОбновления[0]; 
		Элементы.Декорация1.Заголовок = "Есть обновление от " + ДатаОбновления;
		Элементы.Выполнить.Доступность = Истина;
		Движение = РегистрыСведений.ИсторияВерсий.СоздатьМенеджерЗаписи();
		Движение.Версия = Массив[0].commit.message;
		Движение.Период = ТекущаяДата();
		Движение.Записать();		
	КонецЕсли;	


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
