Процедура ПереместитьКнигу(Книга, ШкафОткуда, ШкафКуда, Полка) Экспорт 
	
	СодержаниеКниги = ПолучитьСодержаниеКниги(Книга, ШкафОткуда);	
	СправочникКуда = ПолучитьСправочник(ШкафКуда);
	СправочникОткуда = ПолучитьСправочник(ШкафОткуда);
	
	НовыйЭлемент = СправочникКуда.СоздатьЭлемент();
	НовыйЭлемент.Автор = Книга.Автор;
	НовыйЭлемент.Наименование = Книга.Наименование;
	НовыйЭлемент.Родитель = СправочникКуда.НайтиПоНаименованию(Полка);
	
	Для каждого Строка Из СодержаниеКниги Цикл
		НовоеСодержание = НовыйЭлемент.Содержание.Добавить();
		НовоеСодержание.Глава = Строка.Глава;
		НовоеСодержание.Страница = Строка.Страница;
	КонецЦикла; 
	
	НовыйЭлемент.Записать();
	
	СтараяКнига = СправочникОткуда.НайтиПоКоду(Книга.Код).ПолучитьОбъект();
	
	СтараяКнига.Удалить();
	
КонецПроцедуры

Функция ПолучитьСправочник(ШкафКуда)
	
	Если ШкафКуда = "КнижныйШкаф" Тогда
		Возврат Справочники.КнижныйШкаф;
	ИначеЕсли ШкафКуда = "КнигиВКладовке" Тогда
		Возврат Справочники.КнигиВКладовке;
	ИначеЕсли ШкафКуда = "ШкафНадСтолом" Тогда
		Возврат Справочники.ШкафНадСтолом;
	ИначеЕсли ШкафКуда = "ШкафПосудный" Тогда
		Возврат Справочники.ШкафПосудный;
	ИначеЕсли ШкафКуда = "ШкафПостель" Тогда
		Возврат Справочники.ШкафПостель;
	ИначеЕсли ШкафКуда = "ШкафТелевизор" Тогда
		Возврат Справочники.ШкафТелевизор;
	ИначеЕсли ШкафКуда = "КнигиОтНиколаевой" Тогда
		Возврат Справочники.КнигиОтНиколаевой;
	КонецЕсли;
	
КонецФункции // ПолучитьНовыйЭлементСправочника()

Функция ПолучитьСодержаниеКниги(Книга, Шкаф)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШкафСодержание.Глава КАК Глава,
	|	ШкафСодержание.Страница КАК Страница
	|ИЗ
	|	Справочник.КнижныйШкаф.Содержание КАК ШкафСодержание
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КнижныйШкаф КАК Шкаф
	|		ПО ШкафСодержание.Ссылка = Шкаф.Ссылка
	|ГДЕ
	|	Шкаф.Наименование = &Наименование
	|	И Шкаф.Автор = &Автор";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КнижныйШкаф", Шкаф);
	
	Запрос.УстановитьПараметр("Наименование", Книга.Наименование);
	Запрос.УстановитьПараметр("Автор", Книга.Автор);
	
	Возврат Запрос.Выполнить().Выгрузить()
	
КонецФункции // ПолучитьСодержаниеКниги() 

Функция ПолучитьСписокПолок(Шкаф) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КнижныйШкаф.Наименование КАК Наименование,
	|	КнижныйШкаф.Родитель КАК Родитель,
	|	ВЫБОР
	|		КОГДА КнижныйШкаф.Родитель.ЭтоГруппа
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПодгруппа
	|ИЗ
	|	Справочник.КнижныйШкаф КАК КнижныйШкаф
	|ГДЕ
	|	КнижныйШкаф.ЭтоГруппа = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	КнижныйШкаф.Код";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КнижныйШкаф", Шкаф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокПолок = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЭтоПодгруппа Тогда
			ИмяПолки = ВыборкаДетальныеЗаписи.Родитель.Наименование + " - " + ВыборкаДетальныеЗаписи.Наименование;
			СписокПолок.Добавить(ИмяПолки);
		Иначе
			СписокПолок.Добавить(ВыборкаДетальныеЗаписи.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПолок
	
КонецФункции // ПолучитьСписокПолок()




