
&НаКлиенте
Асинх Процедура Переместить(Команда)
	Если НЕ СтрНайти(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока, "полка") > 0 Тогда
		Книга = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
		ЭтотШкаф = СтрРазделить(ЭтаФорма.ИмяФормы, ".");
		СписокШкафов = Перемещение.СоздатьСписокШкафов(ЭтотШкаф[1]);
		Шкаф = ЖДАТЬ ВопросАсинх("Куда переместить?", СписокШкафов);
		СписокПолок = ПеремещениеСервер.ПолучитьСписокПолок(Шкаф);
		Полка = ЖДАТЬ ВопросАсинх("А на какую полку?", СписокПолок);
		Перемещение.Переместить(Книга, ЭтотШкаф[1], Шкаф, Полка);
		ЭтотОбъект.ТекущийЭлемент.Обновить();
	Иначе
		ВызватьИсключение ("Мам, ты книгу не выбрала", КатегорияОшибки.НеподдерживаемыйФормат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьВыбранные(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		Ответ = ЖДАТЬ ВопросАсинх("Точно эти книги удалить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Удаление.УдалитьВыбранныеКниги(ВыделенныеСтроки);
			ЭтотОбъект.ТекущийЭлемент.Обновить();
		КонецЕсли;
	Иначе
		ВызватьИсключение ("Мам, не выбрала ничего для удаления", КатегорияОшибки.НеподдерживаемыйФормат);
	КонецЕсли;
КонецПроцедуры

