&НаКлиенте
Процедура Переместить(Книга, ШкафОткуда, ШкафКуда, Полка) Экспорт

	ПеремещениеСервер.ПереместитьКнигу(Книга, ШкафОткуда, ШкафКуда, Полка);	
	
КонецПроцедуры


&НаКлиенте
Функция СоздатьСписокШкафов(Шкаф) Экспорт
	
	Шкафы = Новый СписокЗначений;
	Шкафы.Добавить("КнижныйШкаф", "Книжный шкаф");
	Шкафы.Добавить("КнигиВКладовке", "Книги в кладовке");
	Шкафы.Добавить("ШкафНадСтолом", "Шкаф над столом");
	Шкафы.Добавить("ШкафПосудный", "Шкаф посудный");
	Шкафы.Добавить("ШкафПостель", "Шкаф постель");
	Шкафы.Добавить("ШкафТелевизор", "Шкаф телевизор");
	Шкафы.Добавить("КнигиОтНиколаевой", "Книги от Николаевой");
	
	Для каждого Элемент из Шкафы Цикл
		Если Элемент.Значение = Шкаф Тогда
			Шкафы.Удалить(Элемент);
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Шкафы
	
КонецФункции


